Revit 2026 API

# PlanCircuitGetPointInside Method

---

Returns a point inside the circuit.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public UV GetPointInside()
```
```vb
Public Function GetPointInside As UV
```
```cpp
public:
UV^ GetPointInside()
```
```fsharp
member GetPointInside : unit -> UV
```

#### Return Value

UV

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when a valid UV point couldn't be obtained. |

#### Reference

PlanCircuit Class

Autodesk.Revit.DB Namespace